Documents/ESB/ESB_Consumer_0605/003TestSample/SAMPLE_XML_MUST/Loan/LO27_LoanMtrtyDateRateModRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/Loan/LoanMtrtyDateRateModRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>Loan</ServiceDomain>  
      <OperationName>LoanMtrtyDateRateMod</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:LoanMtrtyDateRateModRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>LO27</v11:TxnId>  
        <v11:TxnNo>LO2700001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <v11:ArrngId>AA193379H1QP</v11:ArrngId>  
        <!--Zero or more repetitions:-->  
        <v11:CustRec></v11:CustRec>  
        <v11:ProdName>AL.TERM.LN</v11:ProdName>  
        <!--Optional:-->  
        <v11:Ccy>TWD</v11:Ccy>  
        <!--Optional:-->  
        <v11:TxnType>LENDING-CHANGE.MATURITYDATE-ARRANGEMENT</v11:TxnType>  
        <v11:EffDate>20200504</v11:EffDate>  
        <!--Optional:-->  
        <v11:CmmtmntInfo> 
          <v11:MtrtyDate>20251203</v11:MtrtyDate> 
        </v11:CmmtmntInfo>  
        <!--Optional:-->  
        <v11:PrncplIntrstRec></v11:PrncplIntrstRec>  
        <!--Optional:-->  
        <v11:PnltyIntrstRec> 
          <v11:IntrstRateRec> 
            <!--Optional:-->  
            <v11:FixRate>0</v11:FixRate>  
            <v11:MargRec></v11:MargRec> 
          </v11:IntrstRateRec> 
        </v11:PnltyIntrstRec>  
        <!--Optional:-->  
        <v11:PmtRec></v11:PmtRec>  
        <!--Optional:-->  
        <v11:IPAddr>IP 172.100.10.22</v11:IPAddr>  
        <!--Optional:-->  
        <v11:APIKey>IF05007</v11:APIKey> 
      </v11:ServiceBody> 
    </v11:LoanMtrtyDateRateModRq> 
  </soap:Body> 
</soap:Envelope>
